
// 3CXDesktopApp  Compromise  
// Quieries to use in Microsoft Defender Adanced Hunting
//https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/

//Look for SHA256 IOC Signatures
let IOC = dynamic(["dde03348075512796241389dfea5560c20a3d2a2eac95c894e7bbed5e85a0acc","fad482ded2e25ce9e1dd3d3ecc3227af714bdfbbde04347dbc1b21d6a3670405","a541e5fc421c358e0a2b07bf4771e897fb5a617998aa4876e0e1baa5fbb8e25c","d459aa0a63140ccc647e9026bfd1fccd4c310c262a88896c57bbe3b6456bd090","d51a790d187439ce030cf763237e992e9196e9aa41797a94956681b6279d1b9a","4e08e4ffc699e0a1de4a5225a0b4920933fbb9cf123cde33e1674fde6d61444f","8c0b7d90f14c55d4f1d0f17e0242efd78fd4ed0c344ac6469611ec72defa6b2d","f47c883f59a4802514c57680de3f41f690871e26f250c6e890651ba71027e4d3","2c9957ea04d033d68b769f333a48e228c32bcf26bd98e51310efd48e80c1789f","268d4e399dbbb42ee1cd64d0da72c57214ac987efbb509c46cc57ea6b214beca","c62dce8a77d777774e059cf1720d77c47b97d97c3b0cf43ade5d96bf724639bd","c13d49ed325dec9551906bafb6de9ec947e5ff936e7e40877feb2ba4bb176396","f1bf4078141d7ccb4f82e3f4f1c3571ee6dd79b5335eb0e0464f877e6e6e3182","2487b4e3c950d56fb15316245b3c51fbd70717838f6f82f32db2efcc4d9da6de","e059c8c8b01d6f3af32257fc2b6fe188d5f4359c308b3684b1e0db2071c3425c","d0f1984b4fe896d0024533510ce22d71e05b20bad74d53fae158dc752a65782e"]);
DeviceProcessEvents
| where SHA256 in~ (IOC)

//Look for FileNames IOC Signatures
let IOC = dynamic(["3CXDesktopApp"]);
DeviceProcessEvents
| where FileName in~ (IOC)

//Look for IOC Domains
let IOC = dynamic(["akamaicontainer.com","akamaitechcloudservices.com","azuredeploystore.com","azureonlinecloud.com","azureonlinestorage.com","dunamistrd.com","glcloudservice.com","journalide.org","msedgepackageinfo.com","msstorageazure.com","msstorageboxes.com","officeaddons.com","officestoragebox.com","pbxcloudeservices.com","pbxphonenetwork.com","pbxsources.com","qwepoi123098.com", "raw.githubusercontent.com","sbmsa.wiki","sourceslabs.com", "visualstudiofactory.com","zacharryblogs.com"]);
DeviceNetworkEvents
| where RemoteUrl in~ (IOC)